// 1 Задание ===========================================================================
// let userName = 'Павел'
// let userAge = 28
// if (userAge >= 18) {
//     console.log(`${userName}, Вы совершеннолетний!`);
// } else{
//     console.log(`${userName}, Вам еще нет 18!`);
// }

// 2 Задание ===========================================================================

// let userName = 'Павел'
// let userAge = 28

// userAge >= 18 ? console.log(`${userName}, Вы совершеннолетний!`) : console.log(`${userName}, Вам еще нет 18!`)