// 1 Задание ===========================================================================
// const numbers = [61, 43, 48, 56, 35, 24, 73, 6, 13, 90, 100]
// for (i = 0; i < numbers.length; i++) {
//     if (numbers[i] % 2 == 0){
//         console.log(numbers[i])
//     }
// }
// 2 Задание ===========================================================================
// const rainbow = ['Красный', 'Оранжевый', 'Желтый', 'Зеленый', 'Голубой', 'Синий', 'Фиолетовый']
// for (i = 6; i >= 0; i--){
//     console.log(rainbow[i])
// }