// 1 Задание, цикл через for: (Почему в этом примере i нужно присваивать 2, чтобы цикл отработал корректно, а в цикле через while присваивание начинается с 0?)
// for (i = 2; i <= 12; i = i + 2){
//     console.log(i)
// }
// 1 Задание, цикл через while:
// let i = 0
// while (i < 12) {
//     i = i + 2
//     console.log(i)
// }
// ===========================================================================
// 2 Задание, цикл через for: (Здесь тоже вопрос,почему разные записи условий и обозначение переменных при том,что циклы выполняют одно и тоже действие??)
// for (i = 10; i > 0; i--){
//     console.log(i)
// }
// 2 Задание, цикл через while:
// let i = 11
// while (i > 1) {
//     i--
//     console.log(i)
// }